["Yamini Bhaskar\nOperations Manager at Holmusk\n\nWork Experience\nOperations Manager  at   Holmusk\nJuly 2015  -  Present (4 months)\n\nHolmusk is an innovative telehealth platform that uses data (analytics, visualization, prediction, signaling\n etc.) to tackle chronic diseases and influence positive health outcomes.  My role as an Ops Manager involves\n connecting with partners, collaborators and users Startup-related tasks:creating presentations,market research\n and managing the daily operations of the company\n\nJunior Trainer/Presenter  at   Wildlife Reserves Singapore\nJuly 2010  -  Present (5 years 4 months)\n\nPresenting animal shows Husbandry of animals Enrichment Educating visitors about animal conservation\n\nPHD Researcher  at   Nanyang Technological University (NTU Singapore)\nJanuary 2014  -  November 2014  (11 months)\n\nFunctional studies about the neural circuitry in the brain and how it changes under stress using resilient\n models.\n\nResearch Associate  at   Nanyang Technological University\nNovember 2012  -  January 2014  (1 year 3 months)\n\nNeuroscience research on stress and resilience using animal models.\n\nResearch Intern  at   Genome Institute of Singapore at A*Star\nAugust 2012  -  September 2012  (2 months)\n\nWorked on identifying biomarkers that play an important role in targeted cancer therapy. Data mining to\n identify biomarkers in existence and their relevant drug responses in targeted cancer therapy.\n\nLanguages\nTamil\nHindi\nKannada\nEnglish\n\nProjects\nBrain computer interfacing by EEG modulation\nMarch 2009 to November 2009\nMembers:Yamini B., vinoth S., Uma Bhavani\n\n(Native or bilingual proficiency)\n(Full professional proficiency)\n(Native or bilingual proficiency)\n(Native or bilingual proficiency)\n\nDesigned and constructed a Brain Computer Interface (BCI) using LABVIEW and ELVIS to detect visually\n evoked potentials and train users to control the glowing of an LED on the computer screen by voluntary\n electroencephalogram (EEG) modulation. This BCI system requires only two electrodes, and has a relatively\n short training time for both the user and the machine. This will be greatly beneficial for paralytic patients.\n\nAuto tracking of movement of a mouse in a maze using LabVIEW:\nMay 2009 to May 2010\nMembers:Yamini B., vinoth S., Uma Bhavani, Thenmozhi\n\nDesigned and constructed a system to automatically track the movements of mice in an 8 arm radial maze.\n We used IR sensors fitted into the sides of each arm of the maze and connected that to a PCB which was\n connected to the computer with LabVIEW. This maze is designed to perform studies on the spatial learning\n and memory of rodents. The basic information necessary to the researchers is the entry of the mouse in each\n arm and the time spent by the mouse in each arm. Using the analog circuit as well as LabVIEW we were able\n to provide the above information. \n\nDesign of a motion capture system for upper limb movement analysis\nMarch 2011 to December 2011\nMembers:Yamini B.\n\nDesigned an optimal system to track the upper limb movement of normal subjects performing activities of\n daily living using Qualysis Motion Tracking system and addressed issues such as occlusion of markers and\n space constraints to provide a stable and reliable system for future trials to be conducted on stroke patients in\n hospitals.\n\nHonors and Awards\nFirst place in paper presentation at national level technical symposium\nAnna University\nMarch 2009\n\nPresented a paper titled \"Use of biomaterials in tissue engineering\" and was awarded the first place for that\n presentation.\n\nSecond place in paper presentation at inter collegiate symposium\nJerusalem College of Engineering\nSeptember 2008\n\nPresented a paper titled \"Use of Neural Networks in Breast Cancer Detection\" \n\nFirst place in poster designing competition\nBannari Amman Institute of Technology\nOctober 2009\n\nDesigned a poster on the theme \"Global opportunites and challenges of Technical Students\" in the 12th ISTE\n Students' National Convention.\n\nVolunteer Experience\nVolunteer teacher  at   SINDA\n\n\n\nAugust 2011  -  Present (4 years 3 months)\n\nConduct reading classes for children on weekends to help them improve their english reading skills.\n\nCertifications\nRCULA\n\nSkills & Expertise\nMatlab\nLabview\nBiomedical Engineering\nImage Processing\nMicrosoft Office\nBiomaterials\nMolecular Biology\nMedical Devices\nMicrosoft Excel\nMedical Research\nQualysis\nMotion Capture\nData Mining\nReal-time Data Acquisition\nPhotoshop\n\nEducation\nNanyang Technological University\nMSc, Biomedical Engineering, 2010 - 2011\nAnna University\nBachelor of Engineering (B.E.), Biomedical/Medical Engineering, 2006 - 2010\nActivities and Societies:  Student council, NGO-Third Vision\nBishop Cotton's womens christian college\n2004 - 2006\nActivities and Societies:  Modelling, Dancing\n\nInterests\nAnimals, writing, reading, artwork, travelling\n\nLocation\n131 Whitecross Street, London\n\n\n\n"]