"Russell Ong\nSenior Software Engineer - iOS at ReQall PTE LTD\n\nSummary\n\n- iOS and Android Application Development with app on the App Store - Various Smartwatches SDK\n implementation - Web application development for various clients using Ruby on Rails. - Various Facebook\n API integration - Various OAuth/OpenID integration  Specialties: Mobile/Web Application Development,\n CMS/CRM/ERP Development, iOS/Android Development, Facebook/Twitter Application Development,\n Ruby, Ruby on Rails, Objective-C, REST/SOAP Frameworks, OAuth/OpenID Integration\n\nExperience\nSenior Software Engineer  at   ReQall Technologies PTE LTD\nMarch 2012  -  Present (3 years 8 months)\n\n- Mobile Applications development using native iOS and Android. - Integration with various smartwatch\n SDKs (Pebble, Samsung Gear/Gear Fit, Qualcomm Toq, Sony SmartWatch, Android Wear, iWatch) -\n Integration with Auto manufacturer SDKs (mySPIN)\n\nAssistant Professor  at   Chiang Kai Shek College\nJune 2009  -  April 2012  (2 years 11 months)\n\nSenior Software Engineer  at   Rivereo\nJanuary 2011  -  March 2012  (1 year 3 months)\n\n- Web/Mobile Application Development - Various API integration\n\nSoftware Engineer  at   Exist Global\nAugust 2010  -  December 2010  (5 months)\n\nWeb Application Development\n\nSenior Software Engineer  at   Brewed Concepts Inc\nJuly 2006  -  August 2010  (4 years 2 months)\n\nWeb Developer Team Management Systems Architect\n\nWeb/Mobile Developer  at   E Commerce Percs\nApril 2006  -  July 2006  (4 months)\n\nMobile/Web Application Development\n\nProjects\nZeroIN\n\nPage1\n\n\fApril 2013 to Present\nMembers:Russell O., Yat Pan Ng\n\nZeroIN is the first context-aware, intelligent messaging app for the car. It uses your personal smartphone\n to keep email distractions to a minimum, no matter what car you're in. Only messages that are important,\n contain actionable content and merit attention are read out, and drivers can simply respond by voice  to\n keep their eyes on the road and  hands on the wheel.  Stay connected to what's important - ZeroIN restricts\n incoming messages to just those from important contacts, and then distills the content to just the parts that\n require your attention.   Take action safely  reply to both incoming and pending action items via voice. \n\nRecordr\nDecember 2012 to Present\nMembers:Russell O., Grae Joquico\n\nRecordr is the easiest audio/sound/voice recorder you can find. You can have the recordings automatically\n sync across your devices with iCloud. It even allows you to record and play in the background!  Other\n features includes:  1. Sync files via your iTunes. 2. Share recordings via SoundCloud 3. Backup media files\n to your Dropbox account 4. Upload to your Google Drive Account 5. Send to friends via E-Mail.  Recordr\n produces high quality recordings that can be used for interviews.\n\nSoFAB.com.ph\nSeptember 2010 to Present\nMembers:Russell O., Bryan Chan, Richard G., Grae Joquico\nCMG.com.ph\nDecember 2010 to Present\nMembers:Russell O., Richard G., Bryan Chan, Grae Joquico\nSoFAB iPad Application\nJanuary 2011 to Present\nMembers:Russell O., Richard G., Bryan Chan\n\nLanguages\nEnglish\nFilipino\nChinese\n\nSkills & Expertise\nRuby on Rails\nRuby\nFacebook API\nObjective-C\nAJAX\njQuery\nWeb Services\niOS Developer\nJavaScript\n\nPage2\n\n\fREST\niOS\nGit\nAndroid\nPostgreSQL\nHTML 5\nJSON\nTitanium\nSOAP\n\nEducation\nDe La Salle University\nMSCS, IT, 2010 - 2012\nChiang Kai Shek College\nBSCS, Computer Science, 2002 - 2006\n\nInterests\nWebdev, Photography, Scuba Diving, Travel\n\nPublications\nQualcomm Developer of the month\n   July 1, 2014\nAuthors: Russell O.\n\nPage3\n\n\fRussell Ong\nSenior Software Engineer - iOS at ReQall PTE LTD\n\n5 people have recommended Russell\n\n\"It is great working with Russell! A very intuitive guy and knows where to punch and deliver codes. He\nseamlessly integrated Facebook with one of our big projects and cramped tons of AJAX functionality\non another. On a different light, he is always eager to help and share his knowledge to others. And thirst\nto discover more, learn more tricks and experiment with new technology, approach, techniques and\nimplementations.\"\n\n Richard G., managed Russell at Rivereo\n\n\"Russell was a very productive persona colleague and friend who has a \"can-do\" attitude. It was my pleasure\nworking with him for 2 years with him on major business projects and was impressed with the depth of\nknowledge he possesses. Russell is a careful and great software engineer. Self motivated and a proactive\nstrategist. Deliver results all the time but make no mistake, the guy knows how to have fun. That's Russell's\nway. I strongly recommend him.\"\n\n Jurgen Estanislao, UXC, Digital Projects Manager, Thousand Minds Social Media, worked with Russell\nat Brewed Concepts Inc\n\n\"Russell is a great colleague! An excellent programmer/developer who has strong dedication and appreciation\nin all of the projects he handle. He is full of ideas and knowledge which he always share to his co-workers.\nGood job! :)\"\n\n Darryl Anne Gutierrez, worked directly with Russell at Brewed Concepts Inc\n\n\"Russell is a great team-player, an excellent ROR geek, fast learner and a great buddy! ;-) Keep it up!\"\n\n Jeremy D., worked directly with Russell at Brewed Concepts Inc\n\n\"Russell is unbeatable especially in programming techniques. He is self-motivated person. Also I really like\nthe way he treated his co-worker... Just continue being YOU and keep it up!!!\"\n\n Jenilee S., worked directly with Russell at Brewed Concepts Inc\n\nContact Russell on LinkedIn\n\nPage4\n\n\f"